import pytest

"""
pytest ми звертаємося до бібліотеки(фреймворку) pytest, 
fixture ми виконуємо ті дії які виконаютсья до того як ми запустимо кожен наш модуль 
(дія до - прекондішн) діє тільки врамках цього файлу в якому прописаний 
"""

@pytest.fixture()
def set_up():
    print('Вхід в систему ')
    yield
    print('Вихід із системи')
"""
умовний оператор yield, 
все що вище yield це те що буде виконуватися до проходження тесту, 
все що нижче yield буде виконуватися після проходження тесту 
"""


@pytest.fixture(scope="function")
def some():
    print('Початок')
    yield
    print('Кінець')